# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jnsahaj/lumen"
tap "koekeishiya/formulae"
tap "stripe/stripe-cli"

# CLI Tools
brew "bat"
brew "delve"
brew "docker-compose"
brew "fzf"
brew "gemini-cli"
brew "go"
brew "gum"
brew "helm"
brew "jnsahaj/lumen/lumen"
brew "kcat"
brew "keydb"
brew "lazygit"
brew "libvterm"
brew "msgpack"
brew "neovim"
brew "node@22"
brew "numpy"
brew "opencode"
brew "p7zip"
brew "php"
brew "postgresql@14"
brew "python@3.12"
brew "redis"
brew "sevenzip"
brew "stow"
brew "stripe/stripe-cli/stripe"
brew "tmux"
brew "tree-sitter"
brew "unzip"

# Cask Applications (GUI Apps)
cask "claude"
cask "docker"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "monitorcontrol"
cask "warp"

# Optional: Add your commonly used apps
# cask "visual-studio-code"
# cask "slack"
# cask "notion"
# cask "spotify"
# cask "firefox"
# cask "arc"
# cask "raycast"
# cask "1password"
